In [29]:
import pandas as pd

df = pd.read_csv('titanic.data')

## Leitura de dados com o pandas

In [30]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Informação do dataset

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Exploração dos dados

Quantos sobreviveram?

In [32]:
sobreviventes = df.Survived
print(sobreviventes.sum())

342

In [33]:
df.Survived.sum()

342

Quem eram os sobreviventes?

exemplo: 5 linhas
isso [False False False True True] retorna as 2 últimas linhas

In [34]:
df.Survived == 1

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: Survived, Length: 891, dtype: bool

In [35]:
sobreviventes = df[df.Survived == 1]
sobreviventes

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [36]:
len(sobreviventes)

342

Quais são os portos que os sobreviventes embarcaram?

In [37]:
sobreviventes.Embarked.unique()

array(['C', 'S', 'Q', nan], dtype=object)

In [38]:
from collections import Counter

Counter(sobreviventes.Embarked)

Counter({'C': 93, 'S': 217, 'Q': 30, nan: 2})

Quantos homens e mulheres sobreviveram?

In [39]:
Counter(sobreviventes.Sex)

Counter({'female': 233, 'male': 109})

Quantas crianças estavam entre os sobreviventes?

In [40]:
criancas_sobreviventes = sobreviventes[sobreviventes.Age <= 12]
len(criancas_sobreviventes)

40

Quantas crianças não sobreviveram?

In [41]:
death = df[df.Survived == 0]
kid_death = death[death.Age <= 12]
len(kid_death)

29

In [42]:
kid_death = df[(df.Survived == 0) & (df.Age <= 12)]
len(kid_death)

29

Quantas pessoas sobreviveram e não sobreviveram da Primeira Classe (pclass = 1)

In [43]:
P1Survived = df[(df.Pclass == 1) & (df.Survived == 1)]
P1Death = df[(df.Pclass == 1) & (df.Survived == 0)]
print('1', len(P1Survived), '0,', len(P1Death))

1 136 0, 80

Qual o agrupamento dos sobreviventes por classe que viajaram?

In [44]:
df.groupby(['Pclass'])['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

Qual o agrupamento dos sobreviventes por sexo?

In [45]:
df.groupby(['Sex'])['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

Qual o agrupamento dos sobreviventes por faixa de idade?

In [46]:
df['Faixa'] = ''
df.loc[df.Age <= 12, 'Faixa'] = 'kids'
df.loc[(df.Age > 12) & (df.Age <= 18), 'Faixa'] = 'jovens'
df.loc[(df.Age > 18) & (df.Age <= 50), 'Faixa'] = 'Adults'
df.loc[(df.Age > 50) & (df.Age <= 100), 'Faixa'] = 'Seniors'

In [47]:
Counter(df.Faixa)

Counter({'Adults': 511, '': 177, 'Seniors': 64, 'kids': 69, 'jovens': 70})

In [50]:
faixas = df[df.Faixa != '']

In [52]:
faixas.groupby(['Faixa'])['Survived'].mean()

Faixa
           0.293785
Adults     0.387476
Seniors    0.343750
jovens     0.428571
kids       0.579710
Name: Survived, dtype: float64

Qual a relação de tarifa de viagem com sobrevivência?

In [54]:
df.groupby(['Survived'])['Fare'].agg(['min', 'max', 'mean']).reset_index()

   Survived  min       max       mean
0         0  0.0  263.0000  22.117887
1         1  0.0  512.3292  48.395408